/*
 Navicat Premium Dump SQL

 Source Server         : test
 Source Server Type    : MySQL
 Source Server Version : 80044 (8.0.44)
 Source Host           : localhost:3306
 Source Schema         : attendance_sys

 Target Server Type    : MySQL
 Target Server Version : 80044 (8.0.44)
 File Encoding         : 65001

 Date: 02/06/2026 20:07:20
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for team_name
-- ----------------------------
DROP TABLE IF EXISTS `team_name`;
CREATE TABLE `team_name`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `org_unit_id` bigint NOT NULL COMMENT '所属部门ID',
  `team_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '班组名称',
  `shift_category` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '班别（日勤/甲班/乙班/丙班/丁班/预备/其他）',
  `sort_no` int NULL DEFAULT 0 COMMENT '排序号',
  `is_enabled` tinyint NOT NULL DEFAULT 1 COMMENT '是否启用',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_org_team`(`org_unit_id` ASC, `team_name` ASC) USING BTREE,
  INDEX `idx_team_name_org_unit_id`(`org_unit_id` ASC) USING BTREE,
  CONSTRAINT `fk_team_name_org_unit` FOREIGN KEY (`org_unit_id`) REFERENCES `org_unit` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 222 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '班组名称字典表' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of team_name
-- ----------------------------
INSERT INTO `team_name` VALUES (1, 10, '管理人员', NULL, 1, 1, '2026-05-28 19:16:16', '2026-05-31 13:45:09');
INSERT INTO `team_name` VALUES (2, 10, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (3, 10, '运一甲上发', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (4, 10, '运一乙上发', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (5, 10, '运一丙上发', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (6, 10, '运一丁上发', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (7, 10, '运一甲一调', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (8, 10, '运一乙一调', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (9, 10, '运一丙一调', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (10, 10, '运一丁一调', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (11, 10, '运一预备', '预备', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (12, 11, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-31 13:45:31');
INSERT INTO `team_name` VALUES (13, 11, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (14, 11, '运二甲上到', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (15, 11, '运二乙上到', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (16, 11, '运二丙上到', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (17, 11, '运二丁上到', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (18, 11, '运二甲驼调', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (19, 11, '运二乙驼调', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (20, 11, '运二丙驼调', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (21, 11, '运二丁驼调', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (22, 11, '运二甲七调', '甲班', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (23, 11, '运二乙七调', '乙班', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (24, 11, '运二丙七调', '丙班', 13, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (25, 11, '运二丁七调', '丁班', 14, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (26, 11, '运二预备', '预备', 15, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (27, 12, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (28, 12, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (29, 12, '运三甲下到', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (30, 12, '运三乙下到', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (31, 12, '运三丙下到', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (32, 12, '运三丁下到', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (33, 12, '运三甲驼调', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (34, 12, '运三乙驼调', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (35, 12, '运三丙驼调', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (36, 12, '运三丁驼调', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (37, 12, '运三甲六调', '甲班', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (38, 12, '运三乙六调', '乙班', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (39, 12, '运三丙六调', '丙班', 13, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (40, 12, '运三丁六调', '丁班', 14, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (41, 12, '运三预备', '预备', 15, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (42, 13, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (43, 13, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (44, 13, '运四甲直通', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (45, 13, '运四乙直通', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (46, 13, '运四丙直通', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (47, 13, '运四丁直通', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (48, 13, '运四甲南信', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (49, 13, '运四乙南信', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (50, 13, '运四丙南信', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (51, 13, '运四丁南信', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (52, 13, '运四甲五调', '甲班', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (53, 13, '运四乙五调', '乙班', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (54, 13, '运四丙五调', '丙班', 13, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (55, 13, '运四丁五调', '丁班', 14, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (56, 13, '运四预备', '预备', 15, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (57, 14, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (58, 14, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (59, 14, '调度甲站调', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (60, 14, '调度乙站调', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (61, 14, '调度丙站调', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (62, 14, '调度丁站调', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (63, 14, '调度甲车号', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (64, 14, '调度乙车号', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (65, 14, '调度丙车号', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (66, 14, '调度丁车号', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (67, 14, '调度预备', '预备', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (68, 15, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (69, 15, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (70, 15, '货检甲上到', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (71, 15, '货检乙上到', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (72, 15, '货检丙上到', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (73, 15, '货检丁上到', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (74, 15, '货检甲上出发', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (75, 15, '货检乙上出发', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (76, 15, '货检丙上出发', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (77, 15, '货检丁上出发', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (78, 15, '货检甲下到', '甲班', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (79, 15, '货检乙下到', '乙班', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (80, 15, '货检丙下到', '丙班', 13, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (81, 15, '货检丁下到', '丁班', 14, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (82, 15, '货检甲下直编', '甲班', 15, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (83, 15, '货检乙下直编', '乙班', 16, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (84, 15, '货检丙下直编', '丙班', 17, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (85, 15, '货检丁下直编', '丁班', 18, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (86, 15, '货检预备', '预备', 19, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (87, 16, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (88, 16, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (89, 16, '上行减速顶维修', '其他', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (90, 16, '下行减速顶维修', '其他', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (91, 16, '综合服务', '其他', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (92, 16, '综合维修', '其他', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (93, 16, '设备维修', '其他', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (94, 16, '汽车库', '其他', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (95, 16, '食堂', '其他', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (96, 16, '绿化', '其他', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (97, 16, '护路队', '其他', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (98, 16, '基建', '其他', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (99, 16, '后勤', '其他', 13, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (100, 17, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (101, 17, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (102, 17, '塘运甲行车', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (103, 17, '塘运乙行车', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (104, 17, '塘运丙行车', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (105, 17, '塘运丁行车', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (106, 17, '塘运泰达行配甲班', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (107, 17, '塘运泰达行配乙班', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (108, 17, '塘运泰达行配丙班', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (109, 17, '塘运泰达行配丁班', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (110, 17, '甲一调', '甲班', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (111, 17, '乙一调', '乙班', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (112, 17, '丙一调', '丙班', 13, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (113, 17, '丁一调', '丁班', 14, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (114, 17, '塘运行车半', '其他', 15, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (115, 17, '塘运一调半', '其他', 16, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (116, 17, '塘运日勤', '日勤', 17, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (117, 18, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (118, 18, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (119, 18, '新编甲行配', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (120, 18, '新编乙行配', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (121, 18, '新编丙行配', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (122, 18, '新编丁行配', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (123, 18, '甲二调', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (124, 18, '乙二调', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (125, 18, '丙二调', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (126, 18, '丁二调', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (127, 18, '甲五调', '甲班', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (128, 18, '乙五调', '乙班', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (129, 18, '丙五调', '丙班', 13, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (130, 18, '丁五调', '丁班', 14, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (131, 18, '甲七调', '甲班', 15, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (132, 18, '乙七调', '乙班', 16, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (133, 18, '丙七调', '丙班', 17, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (134, 18, '丁七调', '丁班', 18, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (135, 18, '驼峰检修', '其他', 19, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (136, 18, '新编行配半班', '其他', 20, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (137, 18, '新编二调半', '其他', 21, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (138, 18, '新编五调半', '其他', 22, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (139, 18, '新编七调半', '其他', 23, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (140, 18, '新编半调', '其他', 24, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (141, 18, '新编日勤', '日勤', 25, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (142, 19, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (143, 19, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (144, 19, '一区甲配扳', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (145, 19, '一区乙配扳', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (146, 19, '一区丙配扳', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (147, 19, '一区丁配扳', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (148, 19, '甲四调', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (149, 19, '乙四调', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (150, 19, '丙四调', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (151, 19, '丁四调', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (152, 19, '四调半', '其他', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (153, 19, '一区日勤', '日勤', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (154, 21, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (155, 21, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (156, 21, '调度甲班', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (157, 21, '调度乙班', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (158, 21, '调度丙班', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (159, 21, '调度丁班', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (160, 21, '调度日勤', '日勤', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (161, 22, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (162, 22, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (163, 22, '客运甲班', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (164, 22, '客运乙班', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (165, 22, '客运丙班', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (166, 22, '客运票房', '其他', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (167, 22, '客运日勤', '日勤', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (168, 27, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (169, 27, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (170, 27, '张贵庄行车甲班', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (171, 27, '张贵庄行车乙班', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (172, 27, '张贵庄行车丙班', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (173, 27, '张贵庄行车丁班', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (174, 27, '张贵庄调车甲班', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (175, 27, '张贵庄调车乙班', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (176, 27, '张贵庄调车丙班', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (177, 27, '张贵庄调车丁班', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (178, 27, '张贵庄综合班组', '其他', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (179, 27, '张贵庄调车半班', '其他', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (180, 28, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (181, 28, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (182, 28, '军粮城行配甲班', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (183, 28, '军粮城行配乙班', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (184, 28, '军粮城行配丙班', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (185, 28, '军粮城行配丁班', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (186, 28, '军粮城一调甲班', '甲班', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (187, 28, '军粮城一调乙班', '乙班', 8, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (188, 28, '军粮城一调丙班', '丙班', 9, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (189, 28, '军粮城一调丁班', '丁班', 10, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (190, 28, '军粮城二调甲班', '甲班', 11, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (191, 28, '军粮城二调乙班', '乙班', 12, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (192, 28, '军粮城二调丙班', '丙班', 13, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (193, 28, '军粮城二调丁班', '丁班', 14, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (194, 28, '军粮城行配半班', '其他', 15, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (195, 28, '军粮城调车半班', '其他', 16, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (196, 28, '军粮城综合班组', '其他', 17, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (197, 29, '管理人员', '日勤', 1, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (198, 29, '专业技术组', '日勤', 2, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (199, 29, '北塘行车甲班', '甲班', 3, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (200, 29, '北塘行车乙班', '乙班', 4, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (201, 29, '北塘行车丙班', '丙班', 5, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (202, 29, '北塘行车丁班', '丁班', 6, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (203, 29, '北塘综合班组', '其他', 7, 1, '2026-05-28 19:16:16', '2026-05-28 21:55:28');
INSERT INTO `team_name` VALUES (204, 20, '管理人员', NULL, 1, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (205, 20, '专业技术组', NULL, 2, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (206, 20, '三区甲行配', NULL, 3, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (207, 20, '三区乙行配', NULL, 4, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (208, 20, '三区丙行配', NULL, 5, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (209, 20, '三区丁行配', NULL, 6, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (210, 20, '甲三调', NULL, 7, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (211, 20, '乙三调', NULL, 8, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (212, 20, '丙三调', NULL, 9, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (213, 20, '丁三调', NULL, 10, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (214, 20, '甲八调', NULL, 11, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (215, 20, '乙八调', NULL, 12, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (216, 20, '丙八调', NULL, 13, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (217, 20, '丁八调', NULL, 14, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (218, 20, '三区行配半班', NULL, 15, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (219, 20, '三调半', NULL, 16, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');
INSERT INTO `team_name` VALUES (220, 20, '八调半', NULL, 17, 1, '2026-05-28 19:16:16', '2026-05-28 19:16:16');

SET FOREIGN_KEY_CHECKS = 1;
